; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=342, out_folder=./training, instance_id=74, seed=2098, goal_proportion=0.03

(define (problem blocksworld-74)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 - object)
 (:init 
    (arm-empty)
    (clear b46)
    (on b46 b198)
    (on b198 b294)
    (on b294 b130)
    (on b130 b126)
    (on-table b126)
    (clear b231)
    (on b231 b27)
    (on b27 b96)
    (on b96 b72)
    (on b72 b179)
    (on-table b179)
    (clear b291)
    (on b291 b336)
    (on b336 b281)
    (on b281 b212)
    (on b212 b8)
    (on-table b8)
    (clear b153)
    (on b153 b232)
    (on b232 b80)
    (on b80 b124)
    (on b124 b54)
    (on b54 b168)
    (on-table b168)
    (clear b236)
    (on b236 b78)
    (on-table b78)
    (clear b64)
    (on-table b64)
    (clear b74)
    (on b74 b315)
    (on b315 b39)
    (on b39 b104)
    (on b104 b100)
    (on b100 b143)
    (on b143 b331)
    (on b331 b188)
    (on b188 b4)
    (on b4 b216)
    (on b216 b302)
    (on b302 b89)
    (on-table b89)
    (clear b44)
    (on-table b44)
    (clear b10)
    (on b10 b62)
    (on b62 b261)
    (on b261 b149)
    (on b149 b282)
    (on-table b282)
    (clear b205)
    (on b205 b170)
    (on b170 b102)
    (on-table b102)
    (clear b2)
    (on-table b2)
    (clear b256)
    (on b256 b152)
    (on b152 b161)
    (on b161 b199)
    (on b199 b196)
    (on b196 b87)
    (on-table b87)
    (clear b262)
    (on b262 b22)
    (on b22 b273)
    (on-table b273)
    (clear b146)
    (on b146 b317)
    (on b317 b191)
    (on b191 b224)
    (on-table b224)
    (clear b98)
    (on-table b98)
    (clear b160)
    (on b160 b9)
    (on b9 b323)
    (on b323 b122)
    (on b122 b210)
    (on b210 b217)
    (on b217 b12)
    (on b12 b235)
    (on b235 b6)
    (on b6 b131)
    (on b131 b114)
    (on b114 b23)
    (on b23 b40)
    (on b40 b219)
    (on b219 b48)
    (on b48 b192)
    (on b192 b211)
    (on b211 b264)
    (on-table b264)
    (clear b226)
    (on b226 b97)
    (on b97 b175)
    (on-table b175)
    (clear b201)
    (on b201 b135)
    (on b135 b303)
    (on b303 b164)
    (on-table b164)
    (clear b53)
    (on b53 b193)
    (on b193 b223)
    (on b223 b133)
    (on b133 b206)
    (on b206 b38)
    (on b38 b52)
    (on b52 b183)
    (on b183 b308)
    (on b308 b79)
    (on b79 b329)
    (on-table b329)
    (clear b248)
    (on b248 b314)
    (on b314 b59)
    (on b59 b42)
    (on-table b42)
    (clear b321)
    (on b321 b260)
    (on b260 b84)
    (on b84 b247)
    (on b247 b242)
    (on b242 b43)
    (on b43 b19)
    (on b19 b155)
    (on b155 b292)
    (on-table b292)
    (clear b278)
    (on b278 b186)
    (on-table b186)
    (clear b222)
    (on b222 b204)
    (on b204 b182)
    (on b182 b15)
    (on-table b15)
    (clear b112)
    (on b112 b25)
    (on b25 b245)
    (on b245 b239)
    (on b239 b66)
    (on b66 b337)
    (on b337 b82)
    (on-table b82)
    (clear b31)
    (on b31 b108)
    (on b108 b5)
    (on-table b5)
    (clear b169)
    (on b169 b105)
    (on b105 b14)
    (on-table b14)
    (clear b230)
    (on b230 b296)
    (on-table b296)
    (clear b81)
    (on-table b81)
    (clear b237)
    (on b237 b241)
    (on-table b241)
    (clear b90)
    (on b90 b255)
    (on b255 b107)
    (on b107 b305)
    (on-table b305)
    (clear b221)
    (on b221 b141)
    (on b141 b68)
    (on b68 b34)
    (on b34 b267)
    (on b267 b1)
    (on-table b1)
    (clear b218)
    (on b218 b298)
    (on-table b298)
    (clear b213)
    (on b213 b93)
    (on b93 b55)
    (on b55 b94)
    (on-table b94)
    (clear b334)
    (on b334 b16)
    (on b16 b75)
    (on b75 b30)
    (on b30 b83)
    (on b83 b233)
    (on-table b233)
    (clear b158)
    (on-table b158)
    (clear b272)
    (on b272 b29)
    (on b29 b238)
    (on b238 b332)
    (on b332 b174)
    (on-table b174)
    (clear b244)
    (on-table b244)
    (clear b301)
    (on-table b301)
    (clear b73)
    (on b73 b286)
    (on b286 b51)
    (on b51 b328)
    (on b328 b180)
    (on b180 b69)
    (on b69 b148)
    (on-table b148)
    (clear b92)
    (on b92 b77)
    (on b77 b86)
    (on b86 b316)
    (on b316 b269)
    (on b269 b300)
    (on-table b300)
    (clear b134)
    (on b134 b173)
    (on b173 b50)
    (on b50 b246)
    (on b246 b119)
    (on-table b119)
    (clear b289)
    (on b289 b194)
    (on b194 b258)
    (on-table b258)
    (clear b187)
    (on b187 b310)
    (on b310 b37)
    (on b37 b128)
    (on-table b128)
    (clear b151)
    (on b151 b95)
    (on b95 b45)
    (on b45 b71)
    (on b71 b156)
    (on-table b156)
    (clear b276)
    (on-table b276)
    (clear b274)
    (on-table b274)
    (clear b167)
    (on b167 b268)
    (on b268 b57)
    (on b57 b162)
    (on b162 b227)
    (on-table b227)
    (clear b254)
    (on b254 b299)
    (on b299 b318)
    (on b318 b333)
    (on b333 b209)
    (on b209 b293)
    (on b293 b271)
    (on b271 b136)
    (on-table b136)
    (clear b132)
    (on-table b132)
    (clear b326)
    (on b326 b215)
    (on b215 b208)
    (on b208 b280)
    (on b280 b61)
    (on b61 b207)
    (on-table b207)
    (clear b32)
    (on-table b32)
    (clear b41)
    (on-table b41)
    (clear b165)
    (on b165 b178)
    (on-table b178)
    (clear b279)
    (on b279 b36)
    (on-table b36)
    (clear b125)
    (on b125 b220)
    (on-table b220)
    (clear b322)
    (on b322 b297)
    (on b297 b120)
    (on b120 b319)
    (on b319 b166)
    (on b166 b171)
    (on b171 b259)
    (on b259 b137)
    (on b137 b266)
    (on b266 b21)
    (on b21 b20)
    (on-table b20)
    (clear b285)
    (on b285 b109)
    (on b109 b139)
    (on b139 b116)
    (on b116 b123)
    (on-table b123)
    (clear b203)
    (on b203 b181)
    (on-table b181)
    (clear b249)
    (on b249 b270)
    (on b270 b190)
    (on b190 b13)
    (on b13 b150)
    (on b150 b295)
    (on b295 b265)
    (on b265 b63)
    (on b63 b11)
    (on b11 b324)
    (on b324 b320)
    (on-table b320)
    (clear b65)
    (on-table b65)
    (clear b117)
    (on b117 b7)
    (on b7 b234)
    (on b234 b18)
    (on b18 b138)
    (on b138 b103)
    (on b103 b228)
    (on b228 b263)
    (on b263 b56)
    (on b56 b243)
    (on b243 b335)
    (on b335 b111)
    (on b111 b284)
    (on b284 b129)
    (on b129 b275)
    (on-table b275)
    (clear b309)
    (on b309 b306)
    (on-table b306)
    (clear b339)
    (on b339 b76)
    (on-table b76)
    (clear b327)
    (on b327 b214)
    (on-table b214)
    (clear b163)
    (on b163 b115)
    (on b115 b140)
    (on b140 b70)
    (on b70 b157)
    (on b157 b341)
    (on-table b341)
    (clear b91)
    (on b91 b33)
    (on b33 b253)
    (on-table b253)
    (clear b200)
    (on b200 b172)
    (on b172 b240)
    (on-table b240)
    (clear b154)
    (on b154 b26)
    (on b26 b257)
    (on b257 b229)
    (on b229 b225)
    (on-table b225)
    (clear b47)
    (on-table b47)
    (clear b250)
    (on b250 b311)
    (on b311 b176)
    (on b176 b101)
    (on-table b101)
    (clear b290)
    (on b290 b342)
    (on b342 b202)
    (on b202 b283)
    (on b283 b85)
    (on b85 b325)
    (on b325 b110)
    (on b110 b313)
    (on b313 b184)
    (on b184 b147)
    (on b147 b142)
    (on-table b142)
    (clear b144)
    (on b144 b3)
    (on b3 b28)
    (on-table b28)
    (clear b340)
    (on b340 b113)
    (on b113 b330)
    (on-table b330)
    (clear b118)
    (on b118 b145)
    (on b145 b35)
    (on b35 b159)
    (on-table b159)
    (clear b185)
    (on b185 b189)
    (on b189 b252)
    (on-table b252)
    (clear b24)
    (on b24 b88)
    (on b88 b251)
    (on-table b251)
    (clear b49)
    (on b49 b195)
    (on b195 b67)
    (on b67 b287)
    (on-table b287)
    (clear b99)
    (on-table b99)
    (clear b58)
    (on b58 b307)
    (on-table b307)
    (clear b17)
    (on b17 b177)
    (on b177 b106)
    (on b106 b277)
    (on-table b277)
    (clear b197)
    (on b197 b127)
    (on b127 b338)
    (on b338 b60)
    (on-table b60)
    (clear b288)
    (on-table b288)
    (clear b304)
    (on b304 b312)
    (on-table b312)
    (clear b121)
    (on-table b121))
 (:goal  (and 
    (clear b9)
    (on b9 b8)
    (on b8 b5)
    (on-table b5)
    (clear b6)
    (on b6 b7)
    (on b7 b1)
    (on-table b1)
    (clear b3)
    (on b3 b4)
    (on b4 b2)
    (on b2 b10)
    (on-table b10))))

; plan
1. (unstack b10 b62)
   deleted: (on b10 b62) (clear b10) (arm-empty)
   added: (holding b10) (clear b62)
   goals met: 2 of 13
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 13
3. (unstack b117 b7)
   deleted: (on b117 b7) (clear b117) (arm-empty)
   added: (holding b117) (clear b7)
   goals met: 3 of 13
4. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 3 of 13
5. (unstack b144 b3)
   deleted: (on b144 b3) (clear b144) (arm-empty)
   added: (holding b144) (clear b3)
   goals met: 4 of 13
6. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 4 of 13
7. (unstack b160 b9)
   deleted: (on b160 b9) (clear b160) (arm-empty)
   added: (holding b160) (clear b9)
   goals met: 5 of 13
8. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 5 of 13
9. (unstack b221 b141)
   deleted: (on b221 b141) (clear b221) (arm-empty)
   added: (holding b221) (clear b141)
   goals met: 5 of 13
10. (putdown b221)
   deleted: (holding b221)
   added: (clear b221) (arm-empty) (on-table b221)
   goals met: 5 of 13
11. (unstack b141 b68)
   deleted: (on b141 b68) (clear b141) (arm-empty)
   added: (holding b141) (clear b68)
   goals met: 5 of 13
12. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 5 of 13
13. (unstack b291 b336)
   deleted: (on b291 b336) (clear b291) (arm-empty)
   added: (holding b291) (clear b336)
   goals met: 5 of 13
14. (putdown b291)
   deleted: (holding b291)
   added: (clear b291) (arm-empty) (on-table b291)
   goals met: 5 of 13
15. (unstack b31 b108)
   deleted: (on b31 b108) (clear b31) (arm-empty)
   added: (holding b31) (clear b108)
   goals met: 5 of 13
16. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 5 of 13
17. (unstack b108 b5)
   deleted: (on b108 b5) (clear b108) (arm-empty)
   added: (holding b108) (clear b5)
   goals met: 5 of 13
18. (putdown b108)
   deleted: (holding b108)
   added: (clear b108) (arm-empty) (on-table b108)
   goals met: 5 of 13
19. (unstack b336 b281)
   deleted: (on b336 b281) (clear b336) (arm-empty)
   added: (holding b336) (clear b281)
   goals met: 5 of 13
20. (putdown b336)
   deleted: (holding b336)
   added: (clear b336) (arm-empty) (on-table b336)
   goals met: 5 of 13
21. (unstack b281 b212)
   deleted: (on b281 b212) (clear b281) (arm-empty)
   added: (holding b281) (clear b212)
   goals met: 5 of 13
22. (putdown b281)
   deleted: (holding b281)
   added: (clear b281) (arm-empty) (on-table b281)
   goals met: 5 of 13
23. (unstack b212 b8)
   deleted: (on b212 b8) (clear b212) (arm-empty)
   added: (holding b212) (clear b8)
   goals met: 5 of 13
24. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 5 of 13
25. (unstack b68 b34)
   deleted: (on b68 b34) (clear b68) (arm-empty)
   added: (holding b68) (clear b34)
   goals met: 5 of 13
26. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 5 of 13
27. (unstack b34 b267)
   deleted: (on b34 b267) (clear b34) (arm-empty)
   added: (holding b34) (clear b267)
   goals met: 5 of 13
28. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 5 of 13
29. (unstack b267 b1)
   deleted: (on b267 b1) (clear b267) (arm-empty)
   added: (holding b267) (clear b1)
   goals met: 5 of 13
30. (putdown b267)
   deleted: (holding b267)
   added: (clear b267) (arm-empty) (on-table b267)
   goals met: 5 of 13
31. (unstack b74 b315)
   deleted: (on b74 b315) (clear b74) (arm-empty)
   added: (holding b74) (clear b315)
   goals met: 5 of 13
32. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 5 of 13
33. (unstack b315 b39)
   deleted: (on b315 b39) (clear b315) (arm-empty)
   added: (holding b315) (clear b39)
   goals met: 5 of 13
34. (putdown b315)
   deleted: (holding b315)
   added: (clear b315) (arm-empty) (on-table b315)
   goals met: 5 of 13
35. (unstack b39 b104)
   deleted: (on b39 b104) (clear b39) (arm-empty)
   added: (holding b39) (clear b104)
   goals met: 5 of 13
36. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 5 of 13
37. (unstack b104 b100)
   deleted: (on b104 b100) (clear b104) (arm-empty)
   added: (holding b104) (clear b100)
   goals met: 5 of 13
38. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 5 of 13
39. (unstack b100 b143)
   deleted: (on b100 b143) (clear b100) (arm-empty)
   added: (holding b100) (clear b143)
   goals met: 5 of 13
40. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 5 of 13
41. (unstack b143 b331)
   deleted: (on b143 b331) (clear b143) (arm-empty)
   added: (holding b143) (clear b331)
   goals met: 5 of 13
42. (putdown b143)
   deleted: (holding b143)
   added: (clear b143) (arm-empty) (on-table b143)
   goals met: 5 of 13
43. (unstack b331 b188)
   deleted: (on b331 b188) (clear b331) (arm-empty)
   added: (holding b331) (clear b188)
   goals met: 5 of 13
44. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 5 of 13
45. (unstack b188 b4)
   deleted: (on b188 b4) (clear b188) (arm-empty)
   added: (holding b188) (clear b4)
   goals met: 5 of 13
46. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 5 of 13
47. (unstack b9 b323)
   deleted: (on b9 b323) (clear b9) (arm-empty)
   added: (holding b9) (clear b323)
   goals met: 4 of 13
48. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 6 of 13
49. (unstack b323 b122)
   deleted: (on b323 b122) (clear b323) (arm-empty)
   added: (holding b323) (clear b122)
   goals met: 6 of 13
50. (putdown b323)
   deleted: (holding b323)
   added: (clear b323) (arm-empty) (on-table b323)
   goals met: 6 of 13
51. (unstack b122 b210)
   deleted: (on b122 b210) (clear b122) (arm-empty)
   added: (holding b122) (clear b210)
   goals met: 6 of 13
52. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 6 of 13
53. (unstack b210 b217)
   deleted: (on b210 b217) (clear b210) (arm-empty)
   added: (holding b210) (clear b217)
   goals met: 6 of 13
54. (putdown b210)
   deleted: (holding b210)
   added: (clear b210) (arm-empty) (on-table b210)
   goals met: 6 of 13
55. (unstack b217 b12)
   deleted: (on b217 b12) (clear b217) (arm-empty)
   added: (holding b217) (clear b12)
   goals met: 6 of 13
56. (putdown b217)
   deleted: (holding b217)
   added: (clear b217) (arm-empty) (on-table b217)
   goals met: 6 of 13
57. (unstack b12 b235)
   deleted: (on b12 b235) (clear b12) (arm-empty)
   added: (holding b12) (clear b235)
   goals met: 6 of 13
58. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 13
59. (unstack b235 b6)
   deleted: (on b235 b6) (clear b235) (arm-empty)
   added: (holding b235) (clear b6)
   goals met: 7 of 13
60. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 7 of 13
61. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 13
62. (stack b2 b10)
   deleted: (clear b10) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b10)
   goals met: 8 of 13
63. (unstack b4 b216)
   deleted: (on b4 b216) (clear b4) (arm-empty)
   added: (holding b4) (clear b216)
   goals met: 8 of 13
64. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 9 of 13
65. (unstack b7 b234)
   deleted: (on b7 b234) (clear b7) (arm-empty)
   added: (holding b7) (clear b234)
   goals met: 9 of 13
66. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 10 of 13
67. (unstack b3 b28)
   deleted: (on b3 b28) (clear b3) (arm-empty)
   added: (holding b3) (clear b28)
   goals met: 9 of 13
68. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 11 of 13
69. (unstack b6 b131)
   deleted: (on b6 b131) (clear b6) (arm-empty)
   added: (holding b6) (clear b131)
   goals met: 10 of 13
70. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 12 of 13
71. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 10 of 13
72. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 11 of 13
73. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 11 of 13
74. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 12 of 13
75. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 11 of 13
76. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 13 of 13
